tylertms/kinetis-k22-sim/tests/device/kinetis_k22/platform/host_api_test.c
#include "kinetis_k22.h"

#include <stdint.h>

#include "allocation_failure.h"
#include "device/kinetis_k22/internal.h"
#include "test.h"

enum {
    USB0 = 0x40072000u,
    CAN0 = 0x40024000u,
    I2S0 = 0x4002f000u,
    SPI0 = 0x4002c000u,
    I2C0 = 0x40066000u,
    I2C1 = 0x40067000u,
    UART0 = 0x4006a000u,
};

static KinetisK22* create_device(TestState* state) {
    KinetisK22Configuration configuration = kinetis_k22_default_configuration();
    configuration.profile = KINETIS_K22_PROFILE_MK22FN1M012;
    configuration.package = KINETIS_K22_PACKAGE_LQ_144_LQFP;
    configuration.flash_size = 4096u;
    configuration.sram_size = 65536u;
    KinetisK22* device = kinetis_k22_create(configuration);
    expect(state, device != NULL, "device != NULL");
    const uint32_t vectors[2] = {0x20001000u, 0x101u};
    expect(state, kinetis_k22_load(device, 0u, vectors, sizeof(vectors)),
           "kinetis_k22_load(device, 0u, vectors, sizeof(vectors))");
    expect(state, kinetis_k22_reset(device), "kinetis_k22_reset(device)");
    return device;
}

static void io_write(TestState* state, KinetisK22* device, uint32_t register_address,
                     uint8_t access_size, uint32_t write_value) {
    expect(state, k22_io_write(&device->io, register_address, access_size, write_value),
           "k22_io_write(&device->io, register_address, access_size, write_value)");
}

static void serial_write(TestState* state, KinetisK22* device, uint32_t register_address,
                         uint8_t access_size, uint32_t write_value) {
    expect(state, k22_serial_write(&device->serial, register_address, access_size, write_value),
           "k22_serial_write(&device->serial, register_address, access_size, write_value)");
}

static void test_data_api(TestState* state, KinetisK22* device) {
    const uint32_t seed_value = 0x12345678u;
    uint32_t loaded_value = 0u;
    expect(state, kinetis_k22_seed(device, 0x20000000u, &seed_value, sizeof(seed_value)),
           "kinetis_k22_seed(device, 0x20000000u, &seed_value, sizeof(seed_value))");
    expect(state,
           kinetis_k22_read(device, 0x20000000u, &loaded_value, sizeof(loaded_value)) &&
               loaded_value == seed_value,
           "kinetis_k22_read(device, 0x20000000u, &loaded_value, sizeof(loaded_value)) && "
           "loaded_value == seed_value");
    expect(state, !kinetis_k22_seed(NULL, 0u, &seed_value, sizeof(seed_value)),
           "!kinetis_k22_seed(NULL, 0u, &seed_value, sizeof(seed_value))");

    expect(state, kinetis_k22_set_adc_channel(device, 0u, 31u, 0x1234u),
           "kinetis_k22_set_adc_channel(device, 0u, 31u, 0x1234u)");
    expect(state, !kinetis_k22_set_adc_channel(device, 2u, 0u, 0u),
           "!kinetis_k22_set_adc_channel(device, 2u, 0u, 0u)");
    expect(state, !kinetis_k22_set_adc_channel(NULL, 0u, 0u, 0u),
           "!kinetis_k22_set_adc_channel(NULL, 0u, 0u, 0u)");
    kinetis_k22_set_adc0_channel(device, 3u, 0x4567u);
    kinetis_k22_set_adc0_channel(NULL, 3u, 0u);
    expect(state, kinetis_k22_set_cmp_input(device, 1u, 7u, 1u),
           "kinetis_k22_set_cmp_input(device, 1u, 7u, 1u)");
    expect(state, !kinetis_k22_set_cmp_input(device, 3u, 0u, 0u),
           "!kinetis_k22_set_cmp_input(device, 3u, 0u, 0u)");
    expect(state, !kinetis_k22_set_cmp_input(NULL, 0u, 0u, 0u),
           "!kinetis_k22_set_cmp_input(NULL, 0u, 0u, 0u)");

    expect(state, kinetis_k22_set_lptmr_input(device, 2u, true),
           "kinetis_k22_set_lptmr_input(device, 2u, true)");
    expect(state, !kinetis_k22_set_lptmr_input(device, 3u, false),
           "!kinetis_k22_set_lptmr_input(device, 3u, false)");
    expect(state, !kinetis_k22_set_lptmr_input(NULL, 0u, false),
           "!kinetis_k22_set_lptmr_input(NULL, 0u, false)");
    expect(state, kinetis_k22_trigger_low_voltage_warning(device),
           "kinetis_k22_trigger_low_voltage_warning(device)");
    expect(state, kinetis_k22_trigger_low_voltage_detect(device),
           "kinetis_k22_trigger_low_voltage_detect(device)");
    expect(state, !kinetis_k22_trigger_low_voltage_warning(NULL),
           "!kinetis_k22_trigger_low_voltage_warning(NULL)");
    expect(state, !kinetis_k22_trigger_low_voltage_detect(NULL),
           "!kinetis_k22_trigger_low_voltage_detect(NULL)");
    expect(state, kinetis_k22_set_ewm_input(device, true),
           "kinetis_k22_set_ewm_input(device, true)");
    expect(state, kinetis_k22_ewm_output(device), "kinetis_k22_ewm_output(device)");
    expect(state, !kinetis_k22_set_ewm_input(NULL, false),
           "!kinetis_k22_set_ewm_input(NULL, false)");
    expect(state, !kinetis_k22_ewm_output(NULL), "!kinetis_k22_ewm_output(NULL)");
    expect(state, kinetis_k22_set_llwu_pin(device, 0u, true),
           "kinetis_k22_set_llwu_pin(device, 0u, true)");
    expect(state, !kinetis_k22_set_llwu_pin(device, 16u, false),
           "!kinetis_k22_set_llwu_pin(device, 16u, false)");
    expect(state, !kinetis_k22_set_llwu_pin(NULL, 0u, false),
           "!kinetis_k22_set_llwu_pin(NULL, 0u, false)");
    expect(state, kinetis_k22_trigger_llwu_module(device, 0u),
           "kinetis_k22_trigger_llwu_module(device, 0u)");
    expect(state, !kinetis_k22_trigger_llwu_module(device, 8u),
           "!kinetis_k22_trigger_llwu_module(device, 8u)");
    expect(state, !kinetis_k22_trigger_llwu_module(NULL, 0u),
           "!kinetis_k22_trigger_llwu_module(NULL, 0u)");
    expect(state, kinetis_k22_set_ftm_input(device, 0u, 0u, true),
           "kinetis_k22_set_ftm_input(device, 0u, 0u, true)");
    expect(state, !kinetis_k22_set_ftm_input(device, 4u, 0u, false),
           "!kinetis_k22_set_ftm_input(device, 4u, 0u, false)");
    expect(state, !kinetis_k22_set_ftm_input(NULL, 0u, 0u, false),
           "!kinetis_k22_set_ftm_input(NULL, 0u, 0u, false)");
    expect(state, kinetis_k22_set_ftm_fault(device, 0u, 0u, true),
           "kinetis_k22_set_ftm_fault(device, 0u, 0u, true)");
    expect(state, !kinetis_k22_set_ftm_fault(device, 4u, 0u, false),
           "!kinetis_k22_set_ftm_fault(device, 4u, 0u, false)");
    expect(state, !kinetis_k22_set_ftm_fault(device, 0u, 4u, false),
           "!kinetis_k22_set_ftm_fault(device, 0u, 4u, false)");
    expect(state, !kinetis_k22_set_ftm_fault(NULL, 0u, 0u, false),
           "!kinetis_k22_set_ftm_fault(NULL, 0u, 0u, false)");
    expect(state, kinetis_k22_trigger_ftm_hardware(device, 0u, 0u),
           "kinetis_k22_trigger_ftm_hardware(device, 0u, 0u)");
    expect(state, !kinetis_k22_trigger_ftm_hardware(device, 4u, 0u),
           "!kinetis_k22_trigger_ftm_hardware(device, 4u, 0u)");
    expect(state, !kinetis_k22_trigger_ftm_hardware(device, 0u, 3u),
           "!kinetis_k22_trigger_ftm_hardware(device, 0u, 3u)");
    expect(state, !kinetis_k22_trigger_ftm_hardware(NULL, 0u, 0u),
           "!kinetis_k22_trigger_ftm_hardware(NULL, 0u, 0u)");
    bool ftm_output = true;
    expect(state, kinetis_k22_get_ftm_output(device, 0u, 0u, &ftm_output),
           "kinetis_k22_get_ftm_output(device, 0u, 0u, &ftm_output)");
    expect(state, !ftm_output, "!ftm_output");
    expect(state, !kinetis_k22_get_ftm_output(device, 4u, 0u, &ftm_output),
           "!kinetis_k22_get_ftm_output(device, 4u, 0u, &ftm_output)");
    expect(state, !kinetis_k22_get_ftm_output(NULL, 0u, 0u, &ftm_output),
           "!kinetis_k22_get_ftm_output(NULL, 0u, 0u, &ftm_output)");
    uint16_t output = 0u;
    expect(state, kinetis_k22_get_dac_output(device, 0u, &output),
           "kinetis_k22_get_dac_output(device, 0u, &output)");
    expect(state, !kinetis_k22_get_dac_output(device, 2u, &output),
           "!kinetis_k22_get_dac_output(device, 2u, &output)");
    expect(state, !kinetis_k22_get_dac_output(NULL, 0u, &output),
           "!kinetis_k22_get_dac_output(NULL, 0u, &output)");
    kinetis_k22_rng_seed(device, 0x12345678u);
    kinetis_k22_rng_seed(NULL, 0u);
}

