tylertms/kinetis-k22-sim/tests/device/kinetis_k22/platform/host_api_test.c
static void test_serial_api(TestState* state, KinetisK22* device) {
    expect(state, k22_serial_set_clock_gate(&device->serial, K22_PERIPHERAL_UART0, true),
           "k22_serial_set_clock_gate(&device->serial, K22_PERIPHERAL_UART0, true)");
    serial_write(state, device, UART0 + 3u, 1u, 0x08u);
    serial_write(state, device, UART0 + 7u, 1u, 0x44u);
    expect(state, kinetis_k22_serial_receive(device, KINETIS_K22_SERIAL_UART1, 0x5au, 0u),
           "kinetis_k22_serial_receive(device, KINETIS_K22_SERIAL_UART1, 0x5au, 0u)");
    expect(state, !kinetis_k22_serial_receive(NULL, KINETIS_K22_SERIAL_UART1, 0u, 0u),
           "!kinetis_k22_serial_receive(NULL, KINETIS_K22_SERIAL_UART1, 0u, 0u)");
    uint16_t transmitted_value = 0u;
    expect(state,
           !kinetis_k22_serial_transmit(device, KINETIS_K22_SERIAL_UART1, &transmitted_value),
           "!kinetis_k22_serial_transmit(device, KINETIS_K22_SERIAL_UART1, &transmitted_value)");
    expect(state,
           !kinetis_k22_serial_transmit(device, KINETIS_K22_SERIAL_UART0, &transmitted_value),
           "!kinetis_k22_serial_transmit(device, KINETIS_K22_SERIAL_UART0, &transmitted_value)");
    expect(state, k22_serial_set_clock_gate(&device->serial, K22_PERIPHERAL_UART0, true),
           "k22_serial_set_clock_gate(&device->serial, K22_PERIPHERAL_UART0, true)");
    k22_serial_advance_endpoint(&device->serial, K22_SERIAL_UART0);
    expect(state, kinetis_k22_serial_transmit(device, KINETIS_K22_SERIAL_UART0, &transmitted_value),
           "kinetis_k22_serial_transmit(device, KINETIS_K22_SERIAL_UART0, &transmitted_value)");
    expect(state, transmitted_value == 0x44u, "transmitted_value == 0x44u");
    expect(
        state,
        !kinetis_k22_serial_transmit(device, KINETIS_K22_SERIAL_ENDPOINT_COUNT, &transmitted_value),
        "!kinetis_k22_serial_transmit(device, KINETIS_K22_SERIAL_ENDPOINT_COUNT, "
        "&transmitted_value)");

    expect(state, k22_serial_set_clock_gate(&device->serial, K22_PERIPHERAL_SPI0, true),
           "k22_serial_set_clock_gate(&device->serial, K22_PERIPHERAL_SPI0, true)");
    serial_write(state, device, SPI0, 4u, 0u);
    serial_write(state, device, SPI0 + 0x34u, 4u, 0x98030055u);
    k22_serial_advance(&device->serial, 64u);
    KinetisK22SpiTransfer spi_transfer;
    expect(state, kinetis_k22_spi_transfer(device, KINETIS_K22_SERIAL_SPI0, &spi_transfer),
           "kinetis_k22_spi_transfer(device, KINETIS_K22_SERIAL_SPI0, &spi_transfer)");
    expect(state, spi_transfer.data == 0x55u, "spi_transfer.data == 0x55u");
    expect(state, spi_transfer.chip_selects == 3u, "spi_transfer.chip_selects == 3u");
    expect(state, spi_transfer.clock_and_transfer_attributes == 1u,
           "spi_transfer.clock_and_transfer_attributes == 1u");
    expect(state, spi_transfer.continuous_chip_select, "spi_transfer.continuous_chip_select");
    expect(state, spi_transfer.end_of_queue, "spi_transfer.end_of_queue");
    expect(state, !kinetis_k22_spi_transfer(device, KINETIS_K22_SERIAL_UART0, &spi_transfer),
           "!kinetis_k22_spi_transfer(device, KINETIS_K22_SERIAL_UART0, &spi_transfer)");
    expect(state, !kinetis_k22_spi_transfer(device, KINETIS_K22_SERIAL_SPI0, NULL),
           "!kinetis_k22_spi_transfer(device, KINETIS_K22_SERIAL_SPI0, NULL)");
    expect(state, !kinetis_k22_spi_transfer(device, KINETIS_K22_SERIAL_SPI0, &spi_transfer),
           "empty SPI transfer queue is reported");

    expect(state, k22_serial_set_clock_gate(&device->serial, K22_PERIPHERAL_I2C0, true),
           "k22_serial_set_clock_gate(&device->serial, K22_PERIPHERAL_I2C0, true)");
    expect(state, k22_serial_set_clock_gate(&device->serial, K22_PERIPHERAL_I2C1, true),
           "k22_serial_set_clock_gate(&device->serial, K22_PERIPHERAL_I2C1, true)");
    serial_write(state, device, I2C0 + 2u, 1u, 0xf0u);
    serial_write(state, device, I2C1 + 2u, 1u, 0xf0u);
    serial_write(state, device, I2C0 + 4u, 1u, 0x52u);
    KinetisK22I2cTransfer i2c_transfer;
    expect(state, kinetis_k22_i2c_transfer(device, KINETIS_K22_SERIAL_I2C1, &i2c_transfer),
           "kinetis_k22_i2c_transfer(device, KINETIS_K22_SERIAL_I2C1, &i2c_transfer)");
    expect(state, i2c_transfer.type == KINETIS_K22_I2C_START,
           "i2c_transfer.type == KINETIS_K22_I2C_START");
    expect(state, kinetis_k22_i2c_transfer(device, KINETIS_K22_SERIAL_I2C0, &i2c_transfer),
           "kinetis_k22_i2c_transfer(device, KINETIS_K22_SERIAL_I2C0, &i2c_transfer)");
    expect(state, i2c_transfer.type == KINETIS_K22_I2C_START,
           "i2c_transfer.type == KINETIS_K22_I2C_START");
    expect(state, kinetis_k22_i2c_transfer(device, KINETIS_K22_SERIAL_I2C0, &i2c_transfer),
           "kinetis_k22_i2c_transfer(device, KINETIS_K22_SERIAL_I2C0, &i2c_transfer)");
    expect(state, i2c_transfer.type == KINETIS_K22_I2C_WRITE,
           "i2c_transfer.type == KINETIS_K22_I2C_WRITE");
    expect(state, i2c_transfer.value == 0x52u, "i2c_transfer.value == 0x52u");
    expect(state, !kinetis_k22_i2c_transfer(device, KINETIS_K22_SERIAL_UART0, &i2c_transfer),
           "!kinetis_k22_i2c_transfer(device, KINETIS_K22_SERIAL_UART0, &i2c_transfer)");
    expect(state, !kinetis_k22_i2c_transfer(device, KINETIS_K22_SERIAL_I2C0, NULL),
           "!kinetis_k22_i2c_transfer(device, KINETIS_K22_SERIAL_I2C0, NULL)");
    expect(state, kinetis_k22_i2c_acknowledge(device, KINETIS_K22_SERIAL_I2C0, false),
           "kinetis_k22_i2c_acknowledge(device, KINETIS_K22_SERIAL_I2C0, false)");
    expect(state, !kinetis_k22_i2c_acknowledge(device, KINETIS_K22_SERIAL_UART0, true),
           "!kinetis_k22_i2c_acknowledge(device, KINETIS_K22_SERIAL_UART0, true)");
    expect(state, kinetis_k22_i2c_lose_arbitration(device, KINETIS_K22_SERIAL_I2C0),
           "kinetis_k22_i2c_lose_arbitration(device, KINETIS_K22_SERIAL_I2C0)");
    expect(state, !kinetis_k22_i2c_lose_arbitration(device, KINETIS_K22_SERIAL_UART0),
           "!kinetis_k22_i2c_lose_arbitration(device, KINETIS_K22_SERIAL_UART0)");
    expect(state, kinetis_k22_i2c_receive(device, KINETIS_K22_SERIAL_I2C0, 0x6bu),
           "kinetis_k22_i2c_receive(device, KINETIS_K22_SERIAL_I2C0, 0x6bu)");
    expect(state, !kinetis_k22_i2c_receive(device, KINETIS_K22_SERIAL_UART0, 0u),
           "!kinetis_k22_i2c_receive(device, KINETIS_K22_SERIAL_UART0, 0u)");

    uint8_t uart_received_value = 0u;
    uint16_t spi_received_value = 0u;
    expect(state,
           !kinetis_k22_uart1_receive(NULL, 0u, 0u) &&
               !kinetis_k22_uart1_transmit(NULL, &uart_received_value) &&
               !kinetis_k22_uart1_transmit(device, NULL) && !kinetis_k22_spi0_receive(NULL, 0u) &&
               !kinetis_k22_spi0_transmit(NULL, &spi_received_value) &&
               !kinetis_k22_spi0_transmit(device, NULL) && !kinetis_k22_i2c0_receive(NULL, 0u),
           "legacy serial APIs reject null arguments");
    uint16_t uart_received_count = 0u;
    uint16_t spi_received_count = 0u;
    while (uart_received_count <= K22_SERIAL_FIFO_CAPACITY &&
           kinetis_k22_uart1_receive(device, (uint8_t)uart_received_count, 0u)) {
        uart_received_count++;
    }
    while (spi_received_count <= K22_SERIAL_FIFO_CAPACITY &&
           kinetis_k22_spi0_receive(device, spi_received_count)) {
        spi_received_count++;
    }
    expect(state, uart_received_count != 0u && spi_received_count != 0u,
           "legacy serial receive queues accept data before filling");
    expect(state,
           !kinetis_k22_uart1_receive(device, 0u, 0u) && !kinetis_k22_spi0_receive(device, 0u),
           "legacy serial receive queues reject overflow");
}

static void test_io_api(TestState* state, KinetisK22* device) {
    k22_io_set_clock(&device->io, K22_PERIPHERAL_USB0, true);
    io_write(state, device, USB0 + 0x84u, 1u, 1u << 3u);
    io_write(state, device, USB0 + 0x94u, 1u, 1u);
    expect(state, kinetis_k22_usb_token(device, 3u, 0x69u, false),
           "kinetis_k22_usb_token(device, 3u, 0x69u, false)");
    expect(state, !kinetis_k22_usb_token(NULL, 0u, 0u, false),
           "!kinetis_k22_usb_token(NULL, 0u, 0u, false)");

    k22_io_set_clock(&device->io, K22_PERIPHERAL_CAN0, true);
    io_write(state, device, CAN0, 4u, 0x0fu);
    io_write(state, device, CAN0 + 0x10u, 4u, 0u);
    io_write(state, device, CAN0 + 0x28u, 4u, 1u);
    io_write(state, device, CAN0 + 0x80u, 4u, 4u << 24u);
    KinetisK22CanFrame can_frame = {0x123u, 2u, {1u, 2u}, false, false};
    expect(state, kinetis_k22_can_receive(device, &can_frame),
           "kinetis_k22_can_receive(device, &can_frame)");
    expect(state, !kinetis_k22_can_receive(device, NULL), "!kinetis_k22_can_receive(device, NULL)");
    expect(state, !kinetis_k22_can_receive(NULL, &can_frame),
           "!kinetis_k22_can_receive(NULL, &can_frame)");

