tylertms/kinetis-k22-sim/tests/device/kinetis_k22/platform/host_api_test.c
    k22_io_set_clock(&device->io, K22_PERIPHERAL_I2S0, true);
    io_write(state, device, I2S0, 4u, UINT32_C(0x80000000));
    io_write(state, device, I2S0 + 0x80u, 4u, UINT32_C(0x80000000));
    io_write(state, device, I2S0 + 0x20u, 4u, 0x11223344u);
    uint32_t i2s_sample = 0u;
    expect(state, kinetis_k22_i2s_transmit(device, &i2s_sample),
           "kinetis_k22_i2s_transmit(device, &i2s_sample)");
    expect(state, i2s_sample == 0x11223344u, "i2s_sample == 0x11223344u");
    expect(state, kinetis_k22_i2s_receive(device, 0x55667788u),
           "kinetis_k22_i2s_receive(device, 0x55667788u)");
    expect(state, !kinetis_k22_i2s_transmit(NULL, &i2s_sample),
           "!kinetis_k22_i2s_transmit(NULL, &i2s_sample)");
    expect(state, !kinetis_k22_i2s_receive(NULL, 0u), "!kinetis_k22_i2s_receive(NULL, 0u)");

    bool gpio_high = false;
    expect(state, kinetis_k22_gpio_drive(device, 0u, 1u, true),
           "kinetis_k22_gpio_drive(device, 0u, 1u, true)");
    expect(state, kinetis_k22_gpio_pin(device, 0u, 1u, &gpio_high) && gpio_high,
           "kinetis_k22_gpio_pin(device, 0u, 1u, &gpio_high) && gpio_high");
    expect(state, kinetis_k22_gpio_release(device, 0u, 1u),
           "kinetis_k22_gpio_release(device, 0u, 1u)");
    expect(state, !kinetis_k22_gpio_pin(NULL, 0u, 1u, &gpio_high),
           "!kinetis_k22_gpio_pin(NULL, 0u, 1u, &gpio_high)");
    expect(state, !kinetis_k22_gpio_pin(device, 0u, 1u, NULL),
           "!kinetis_k22_gpio_pin(device, 0u, 1u, NULL)");
    expect(state, !kinetis_k22_gpio_pin(device, UINT8_MAX, 0u, &gpio_high),
           "!kinetis_k22_gpio_pin(device, UINT8_MAX, 0u, &gpio_high)");
    expect(state, !kinetis_k22_gpio_drive(NULL, 0u, 0u, false),
           "!kinetis_k22_gpio_drive(NULL, 0u, 0u, false)");
    expect(state, !kinetis_k22_gpio_release(NULL, 0u, 0u),
           "!kinetis_k22_gpio_release(NULL, 0u, 0u)");
}

static void test_guards(TestState* state, KinetisK22* device) {
    uint32_t guard_value = 0u;
    const uint8_t guard_memory[] = {1u, 2u, 3u, 4u};
    expect(state, !kinetis_k22_reset(NULL), "!kinetis_k22_reset(NULL)");
    expect(state, !kinetis_k22_load(NULL, 0u, guard_memory, sizeof(guard_memory)),
           "!kinetis_k22_load(NULL, 0u, guard_memory, sizeof(guard_memory))");
    expect(state, !kinetis_k22_load(device, 0u, NULL, sizeof(guard_memory)),
           "!kinetis_k22_load(device, 0u, NULL, sizeof(guard_memory))");
    expect(state, !kinetis_k22_load(device, UINT32_MAX, guard_memory, sizeof(guard_memory)),
           "!kinetis_k22_load(device, UINT32_MAX, guard_memory, sizeof(guard_memory))");
    expect(state, !kinetis_k22_read(NULL, 0u, &guard_value, sizeof(guard_value)),
           "!kinetis_k22_read(NULL, 0u, &guard_value, sizeof(guard_value))");
    expect(state, !kinetis_k22_read(device, 0u, NULL, sizeof(guard_value)),
           "!kinetis_k22_read(device, 0u, NULL, sizeof(guard_value))");
    expect(state, !kinetis_k22_write(NULL, 0u, &guard_value, sizeof(guard_value)),
           "!kinetis_k22_write(NULL, 0u, &guard_value, sizeof(guard_value))");
    expect(state, !kinetis_k22_write(device, 0u, NULL, sizeof(guard_value)),
           "!kinetis_k22_write(device, 0u, NULL, sizeof(guard_value))");
    expect(state, !kinetis_k22_copy(NULL, device), "!kinetis_k22_copy(NULL, device)");
    expect(state, !kinetis_k22_copy(device, NULL), "!kinetis_k22_copy(device, NULL)");
    expect(state, !kinetis_k22_memory_read(NULL, 0u, 4u, CORTEX_M4_ACCESS_DEBUG, &guard_value),
           "!kinetis_k22_memory_read(NULL, 0u, 4u, CORTEX_M4_ACCESS_DEBUG, &guard_value)");
    expect(state, !kinetis_k22_memory_read(device, 0u, 4u, CORTEX_M4_ACCESS_DEBUG, NULL),
           "!kinetis_k22_memory_read(device, 0u, 4u, CORTEX_M4_ACCESS_DEBUG, NULL)");
    expect(state, !kinetis_k22_memory_read(device, 0u, 3u, CORTEX_M4_ACCESS_DEBUG, &guard_value),
           "!kinetis_k22_memory_read(device, 0u, 3u, CORTEX_M4_ACCESS_DEBUG, &guard_value)");
    expect(state, !kinetis_k22_memory_write(NULL, 0u, 4u, CORTEX_M4_ACCESS_DEBUG, guard_value),
           "!kinetis_k22_memory_write(NULL, 0u, 4u, CORTEX_M4_ACCESS_DEBUG, guard_value)");
    expect(state, !kinetis_k22_memory_write(device, 0u, 3u, CORTEX_M4_ACCESS_DEBUG, guard_value),
           "!kinetis_k22_memory_write(device, 0u, 3u, CORTEX_M4_ACCESS_DEBUG, guard_value)");
    expect(state, !kinetis_k22_flash_controller_write(NULL, 0u, 4u, guard_value),
           "!kinetis_k22_flash_controller_write(NULL, 0u, 4u, guard_value)");
    expect(state, !kinetis_k22_flash_controller_write(device, UINT32_MAX, 4u, guard_value),
           "!kinetis_k22_flash_controller_write(device, UINT32_MAX, 4u, guard_value)");
    expect(state, !kinetis_k22_flexbus_attach(NULL, 0u, guard_memory, sizeof(guard_memory), false),
           "!kinetis_k22_flexbus_attach(NULL, 0u, guard_memory, sizeof(guard_memory), false)");
    expect(state, !kinetis_k22_flexbus_attach(device, 0u, NULL, sizeof(guard_memory), false),
           "!kinetis_k22_flexbus_attach(device, 0u, NULL, sizeof(guard_memory), false)");
    expect(state, !kinetis_k22_flexbus_attach(device, 0u, guard_memory, 0u, false),
           "!kinetis_k22_flexbus_attach(device, 0u, guard_memory, 0u, false)");
    expect(
        state,
        !kinetis_k22_flexbus_attach(device, UINT32_MAX, guard_memory, sizeof(guard_memory), false),
        "!kinetis_k22_flexbus_attach(device, UINT32_MAX, guard_memory, sizeof(guard_memory), "
        "false)");
    kinetis_k22_flexbus_detach(NULL);
    expect(state, !kinetis_k22_flexbus_read(NULL, 0u, &guard_value, sizeof(guard_value)),
           "!kinetis_k22_flexbus_read(NULL, 0u, &guard_value, sizeof(guard_value))");
    expect(state, !kinetis_k22_flexbus_read(device, 0u, NULL, sizeof(guard_value)),
           "!kinetis_k22_flexbus_read(device, 0u, NULL, sizeof(guard_value))");
    expect(state, !kinetis_k22_flexbus_read(device, 0u, &guard_value, sizeof(guard_value)),
           "!kinetis_k22_flexbus_read(device, 0u, &guard_value, sizeof(guard_value))");
    expect(state, kinetis_k22_set_usb_charger(device, KINETIS_K22_USB_CHARGER_NONE),
           "kinetis_k22_set_usb_charger(device, KINETIS_K22_USB_CHARGER_NONE)");
    expect(state, kinetis_k22_set_usb_charger(device, KINETIS_K22_USB_CHARGER_ERROR),
           "kinetis_k22_set_usb_charger(device, KINETIS_K22_USB_CHARGER_ERROR)");
    expect(state, !kinetis_k22_set_usb_charger(device, (KinetisK22UsbCharger)UINT8_MAX),
           "!kinetis_k22_set_usb_charger(device, (KinetisK22UsbCharger)UINT8_MAX)");
    expect(state, !kinetis_k22_set_usb_charger(NULL, KINETIS_K22_USB_CHARGER_NONE),
           "!kinetis_k22_set_usb_charger(NULL, KINETIS_K22_USB_CHARGER_NONE)");
    expect(state, kinetis_k22_set_usb_pullup(device, true),
           "kinetis_k22_set_usb_pullup(device, true)");
    expect(state, kinetis_k22_set_usb_pullup(device, false),
           "kinetis_k22_set_usb_pullup(device, false)");
    expect(state, !kinetis_k22_set_usb_pullup(NULL, true),
           "!kinetis_k22_set_usb_pullup(NULL, true)");
    KinetisK22Event event;
    while (kinetis_k22_next_event(device, &event)) {
    }
    expect(state, !kinetis_k22_next_event(device, &event),
           "!kinetis_k22_next_event(device, &event)");
    expect(state, !kinetis_k22_next_event(NULL, &event), "!kinetis_k22_next_event(NULL, &event)");
    expect(state, !kinetis_k22_next_event(device, NULL), "!kinetis_k22_next_event(device, NULL)");
}

#ifdef K22_TEST_ALLOCATION_FAILURE
static void test_allocation_failures(TestState* state) {
    KinetisK22Configuration configuration = kinetis_k22_default_configuration();
    configuration.profile = KINETIS_K22_PROFILE_MK22FN1M012;
    configuration.package = KINETIS_K22_PACKAGE_LQ_144_LQFP;
    configuration.flash_size = 4096u;
    configuration.sram_size = 65536u;
    uint32_t failure_count = 0u;
    uint32_t success_count = 0u;
    for (size_t allocation_index = 0u; allocation_index < 24u; allocation_index++) {
        test_fail_allocation_after(allocation_index);
        KinetisK22* device = kinetis_k22_create(configuration);
        test_allow_allocations();
        if (device == NULL) {
            failure_count++;
        } else {
            success_count++;
            kinetis_k22_destroy(device);
        }
    }
    expect(state, failure_count >= 6u && success_count != 0u,
           "device construction handles each allocation boundary");

    KinetisK22* device = kinetis_k22_create(configuration);
    const uint8_t card_data[] = {1u, 2u, 3u, 4u};
    test_fail_allocation_after(0u);
    bool flexbus_attached =
        kinetis_k22_flexbus_attach(device, 0u, card_data, sizeof(card_data), false);
    test_allow_allocations();
    expect(state, !flexbus_attached, "FlexBus attachment reports allocation failure");
    kinetis_k22_destroy(device);
}
#endif

int main(void) {
    TestState state = {0};
    KinetisK22* device = create_device(&state);
    test_data_api(&state, device);
    test_serial_api(&state, device);
    test_io_api(&state, device);
    test_guards(&state, device);
    kinetis_k22_destroy(device);
#ifdef K22_TEST_ALLOCATION_FAILURE
    test_allocation_failures(&state);
#endif
    return test_finish(&state);
}
